bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3BU.xml
<?xml version="1.0" encoding="UTF-8"?>
<part-description-file>
    <variants>
        <variant ordercode="ATxmega256A3BU-AU" package="TQFP64" pinout="QFP_QFN_64" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
        <variant ordercode="ATxmega256A3BU-MH" package="QFN64" pinout="QFP_QFN_64" speedmax="32000000" tempmax="85"
                 tempmin="-40" vccmax="3.6" vccmin="1.6"/>
    </variants>
    <devices>
        <device name="ATxmega256A3BU" architecture="AVR8_XMEGA" family="AVR XMEGA">
            <address-spaces>
                <address-space name="prog" id="prog" start="0x00000" size="0x42000" endianness="little">
                    <memory-segment start="0x00000" size="0x40000" type="flash" rw="RW" exec="1" name="APP_SECTION"
                                    pagesize="512"/>
                    <memory-segment start="0x3E000" size="0x2000" type="flash" rw="RW" exec="1" name="APPTABLE_SECTION"
                                    pagesize="512"/>
                    <memory-segment start="0x40000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION"
                                    pagesize="512"/>
                </address-space>
                <address-space name="data" id="data" start="0x0000" size="0x6000" endianness="little">
                    <memory-segment start="0x0000" size="0x1000" type="io" rw="RW" exec="0" name="IO"/>
                    <memory-segment start="0x1000" size="0x1000" type="eeprom" rw="RW" exec="0" name="MAPPED_EEPROM"/>
                    <memory-segment start="0x2000" size="0x4000" type="ram" rw="RW" exec="0" name="INTERNAL_SRAM"/>
                </address-space>
                <address-space name="eeprom" id="eeprom" start="0x00000" size="0x1000">
                    <memory-segment start="0x00000" size="0x1000" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="32"/>
                </address-space>
                <address-space name="signatures" id="signatures" start="0x0000" size="0x0003">
                    <memory-segment start="0x0000" size="0x0003" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space name="fuses" id="fuses" start="0x0000" size="0x0006">
                    <memory-segment start="0x0000" size="0x0006" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space name="lockbits" id="lockbits" start="0x0000" size="0x0001">
                    <memory-segment start="0x0000" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space name="user_signatures" id="user_signatures" start="0x0000" size="0x0200">
                    <memory-segment start="0x0000" size="0x0200" type="user_signatures" rw="RW" exec="0"
                                    name="USER_SIGNATURES" pagesize="512"/>
                </address-space>
                <address-space name="prod_signatures" id="prod_signatures" start="0x0000" size="0x0034">
                    <memory-segment start="0x0000" size="0x0034" type="other" rw="R" exec="0" name="PROD_SIGNATURES"
                                    pagesize="512"/>
                </address-space>
            </address-spaces>
            <peripherals>
                <module name="GPIO" id="I6085">
                    <instance name="GPIO">
                        <register-group address-space="data" offset="0x0000" name-in-module="GPIO" name="GPIO"/>
                    </instance>
                </module>
                <module name="VPORT" id="I6075" version="XMEGAAU">
                    <instance name="VPORT0">
                        <register-group address-space="data" offset="0x0010" name-in-module="VPORT" name="VPORT0"/>
                    </instance>
                    <instance name="VPORT1">
                        <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
                    </instance>
                    <instance name="VPORT2">
                        <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
                    </instance>
                    <instance name="VPORT3">
                        <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
                    </instance>
                </module>
                <module name="XOCD" id="I6043">
                    <instance name="OCD">
                        <register-group address-space="data" offset="0x002E" name-in-module="OCD" name="OCD"/>
                    </instance>
                </module>
                <module name="CPU" id="I6000">
                    <instance name="CPU">
                        <register-group address-space="data" offset="0x0030" name-in-module="CPU" name="CPU"/>
                        <parameters>
                            <param name="CORE_VERSION" value="V3XJ"/>
                        </parameters>
                    </instance>
                </module>
                <module name="CLK" id="I6073" version="XMEGAAU">
                    <instance name="CLK">
                        <register-group address-space="data" offset="0x0040" name-in-module="CLK" name="CLK"/>
                    </instance>
                </module>
                <module name="PR" id="I6073" version="XMEGAAU">
                    <instance name="PR">
                        <register-group address-space="data" offset="0x0070" name-in-module="PR" name="PR"/>
                    </instance>
                </module>
                <module name="SLEEP" id="I6081" version="XMEGAAU">
                    <instance name="SLEEP">
                        <register-group address-space="data" offset="0x0048" name-in-module="SLEEP" name="SLEEP"/>
                    </instance>
                </module>
                <module name="OSC" id="I6079" version="XMEGAAU">
                    <instance name="OSC">
                        <register-group address-space="data" offset="0x0050" name-in-module="OSC" name="OSC"/>
                        <signals>
                            <signal function="XTAL" group="XTAL2" pad="PR0"/>
                            <signal function="XTAL" group="XTAL1" pad="PR1"/>
                            <signal function="TOSC" group="TOSC2" pad="TOSC2"/>
                            <signal function="TOSC" group="TOSC1" pad="TOSC1"/>
                        </signals>
                    </instance>
                </module>
                <module name="DFLL" id="I6055" version="XMEGAAU">
                    <instance name="DFLLRC32M">
                        <register-group address-space="data" offset="0x0060" name-in-module="DFLL" name="DFLLRC32M"/>
