bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3BU.xml
                    </instance>
                    <instance name="DFLLRC2M">
                        <register-group address-space="data" offset="0x0068" name-in-module="DFLL" name="DFLLRC2M"/>
                    </instance>
                </module>
                <module name="RST" id="I6083" version="XMEGAAU">
                    <instance name="RST">
                        <register-group address-space="data" offset="0x0078" name-in-module="RST" name="RST"/>
                    </instance>
                </module>
                <module name="WDT" id="I6078">
                    <instance name="WDT">
                        <register-group address-space="data" offset="0x0080" name-in-module="WDT" name="WDT"/>
                    </instance>
                </module>
                <module name="MCU" id="I6091" version="XMEGAAU">
                    <instance name="MCU">
                        <register-group address-space="data" offset="0x0090" name-in-module="MCU" name="MCU"/>
                    </instance>
                </module>
                <module name="PMIC" id="I6057">
                    <instance name="PMIC">
                        <register-group address-space="data" offset="0x00A0" name-in-module="PMIC" name="PMIC"/>
                    </instance>
                </module>
                <module name="PORTCFG" id="I6075" version="XMEGAAU">
                    <instance name="PORTCFG">
                        <register-group address-space="data" offset="0x00B0" name-in-module="PORTCFG" name="PORTCFG"/>
                        <signals>
                            <signal field="CLKOUT" function="CLKOUTC" group="CLKOUT" pad="PC7"/>
                            <signal field="CLKEVPIN" function="CLKOUTC_ALT" group="CLKOUT" pad="PC4"/>
                            <signal field="CLKOUT" function="CLKOUTD" group="CLKOUT" pad="PD7"/>
                            <signal field="CLKEVPIN" function="CLKOUTD_ALT" group="CLKOUT" pad="PD4"/>
                            <signal field="CLKOUT" function="CLKOUTE" group="CLKOUT" pad="PE7"/>
                            <signal field="CLKEVPIN" function="CLKOUTE_ALT" group="CLKOUT" pad="PE4"/>
                            <signal field="EVOUT" function="EVOUTC" group="EVOUT" pad="PC7"/>
                            <signal field="CLKEVPIN" function="EVOUTC_ALT" group="EVOUT" pad="PC4"/>
                            <signal field="EVOUT" function="EVOUTD" group="EVOUT" pad="PD7"/>
                            <signal field="CLKEVPIN" function="EVOUTD_ALT" group="EVOUT" pad="PD4"/>
                            <signal field="EVOUT" function="EVOUTE" group="EVOUT" pad="PE7"/>
                            <signal field="CLKEVPIN" function="EVOUTE_ALT" group="EVOUT" pad="PE4"/>
                            <signal function="RTCOUTC" group="RTCOUT" pad="PC6"/>
                        </signals>
                    </instance>
                </module>
                <module name="AES" id="I6096">
                    <instance name="AES">
                        <register-group address-space="data" offset="0x0C0" name-in-module="AES" name="AES"/>
                    </instance>
                </module>
                <module name="CRC" id="I6111" version="XMEGAAU">
                    <instance name="CRC">
                        <register-group address-space="data" offset="0x0D0" name-in-module="CRC" name="CRC"/>
                    </instance>
                </module>
                <module name="VBAT" id="I6107">
                    <instance name="VBAT">
                        <register-group address-space="data" offset="0x0F0" name-in-module="VBAT" name="VBAT"/>
                        <signals>
                            <signal function="VBAT" group="VBAT" pad="VBAT"/>
                        </signals>
                    </instance>
                </module>
                <module name="DMA" id="I3000">
                    <instance name="DMA">
                        <register-group address-space="data" offset="0x0100" name-in-module="DMA" name="DMA"/>
                    </instance>
                </module>
                <module name="EVSYS" id="I6061" version="XMEGAAU">
                    <instance name="EVSYS">
                        <register-group address-space="data" offset="0x0180" name-in-module="EVSYS" name="EVSYS"/>
                    </instance>
                </module>
                <module name="NVM" id="I6076" version="XMEGAAU">
                    <instance name="NVM">
                        <register-group address-space="data" offset="0x01C0" name-in-module="NVM" name="NVM"/>
                    </instance>
                </module>
                <module name="ADC" id="I6099" version="XMEGAAU">
                    <instance name="ADCA">
                        <register-group address-space="data" offset="0x0200" name-in-module="ADC" name="ADCA"/>
                        <signals>
                            <signal function="ADC" group="ADC" index="0" pad="PA0"/>
                            <signal function="ADC" group="ADC" index="1" pad="PA1"/>
                            <signal function="ADC" group="ADC" index="2" pad="PA2"/>
                            <signal function="ADC" group="ADC" index="3" pad="PA3"/>
                            <signal function="ADC" group="ADC" index="4" pad="PA4"/>
                            <signal function="ADC" group="ADC" index="5" pad="PA5"/>
                            <signal function="ADC" group="ADC" index="6" pad="PA6"/>
                            <signal function="ADC" group="ADC" index="7" pad="PA7"/>
                            <signal function="ADC" group="ADC" index="8" pad="PB0"/>
                            <signal function="ADC" group="ADC" index="9" pad="PB1"/>
                            <signal function="ADC" group="ADC" index="10" pad="PB2"/>
                            <signal function="ADC" group="ADC" index="11" pad="PB3"/>
                            <signal function="ADC" group="ADC" index="12" pad="PB4"/>
                            <signal function="ADC" group="ADC" index="13" pad="PB5"/>
                            <signal function="ADC" group="ADC" index="14" pad="PB6"/>
                            <signal function="ADC" group="ADC" index="15" pad="PB7"/>
                            <signal function="AREF" group="REFA" index="0" pad="PA0"/>
                            <signal function="AREF" group="REFB" index="0" pad="PB0"/>
                        </signals>
                    </instance>
