bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/XMEGA/ATXMEGA256A3BU.xml
                <register-group caption="Endpoint 1" name="EP1IN" offset="0x18" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 2" name="EP2OUT" offset="0x20" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 2" name="EP2IN" offset="0x28" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 3" name="EP3OUT" offset="0x30" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 3" name="EP3IN" offset="0x38" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 4" name="EP4OUT" offset="0x40" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 4" name="EP4IN" offset="0x48" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 5" name="EP5OUT" offset="0x50" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 5" name="EP5IN" offset="0x58" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 6" name="EP6OUT" offset="0x60" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 6" name="EP6IN" offset="0x68" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 7" name="EP7OUT" offset="0x70" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 7" name="EP7IN" offset="0x78" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 8" name="EP8OUT" offset="0x80" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 8" name="EP8IN" offset="0x88" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 9" name="EP9OUT" offset="0x90" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 9" name="EP9IN" offset="0x98" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 10" name="EP10OUT" offset="0xA0" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 10" name="EP10IN" offset="0xA8" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 11" name="EP11OUT" offset="0xB0" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 11" name="EP11IN" offset="0xB8" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 12" name="EP12OUT" offset="0xC0" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 12" name="EP12IN" offset="0xC8" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 13" name="EP13OUT" offset="0xD0" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 13" name="EP13IN" offset="0xD8" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 14" name="EP14OUT" offset="0xE0" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 14" name="EP14IN" offset="0xE8" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 15" name="EP15OUT" offset="0xF0" name-in-module="USB_EP"/>
                <register-group caption="Endpoint 15" name="EP15IN" offset="0xF8" name-in-module="USB_EP"/>
            </register-group>
            <value-group caption="Interrupt level" name="USB_INTLVL">
                <value caption="Interrupt disabled" name="OFF" value="0x00"/>
                <value caption="Low level" name="LO" value="0x01"/>
                <value caption="Medium level" name="MED" value="0x02"/>
                <value caption="High level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="USB Endpoint Type" name="USB_EP_TYPE">
                <value caption="Endpoint Disabled" name="DISABLE" value="0x00"/>
                <value caption="Control" name="CONTROL" value="0x01"/>
                <value caption="Bulk/Interrupt" name="BULK" value="0x02"/>
                <value caption="Isochronous" name="ISOCHRONOUS" value="0x03"/>
            </value-group>
            <value-group caption="USB Endpoint Buffersize" name="USB_EP_BUFSIZE">
                <value caption="8 bytes buffer size" name="8" value="0x00"/>
                <value caption="16 bytes buffer size" name="16" value="0x01"/>
                <value caption="32 bytes buffer size" name="32" value="0x02"/>
                <value caption="64 bytes buffer size" name="64" value="0x03"/>
                <value caption="128 bytes buffer size" name="128" value="0x04"/>
                <value caption="256 bytes buffer size" name="256" value="0x05"/>
                <value caption="512 bytes buffer size" name="512" value="0x06"/>
                <value caption="1023 bytes buffer size" name="1023" value="0x07"/>
            </value-group>
            <interrupt-group name="USB">
                <interrupt index="0" name="BUSEVENT"
                           caption="SOF, suspend, resume, reset bus event interrupts, crc, underflow, overflow and stall error interrupts"/>
                <interrupt index="1" name="TRNCOMPL" caption="Transaction complete interrupt"/>
            </interrupt-group>
        </module>
        <module name="PORT" id="I6075" version="XMEGAAU" caption="I/O Port Configuration">
            <register-group caption="I/O Ports" name="PORT" size="24">
                <register caption="I/O Port Data Direction" name="DIR" offset="0x00" size="1"/>
                <register caption="I/O Port Data Direction Set" name="DIRSET" offset="0x01" size="1"/>
                <register caption="I/O Port Data Direction Clear" name="DIRCLR" offset="0x02" size="1"/>
                <register caption="I/O Port Data Direction Toggle" name="DIRTGL" offset="0x03" size="1"/>
                <register caption="I/O Port Output" name="OUT" offset="0x04" size="1"/>
                <register caption="I/O Port Output Set" name="OUTSET" offset="0x05" size="1"/>
                <register caption="I/O Port Output Clear" name="OUTCLR" offset="0x06" size="1"/>
                <register caption="I/O Port Output Toggle" name="OUTTGL" offset="0x07" size="1"/>
